{
  "projects": [
    {
      "id": 1,
      "title": "W3nity",
      "category": "Web3 Collaboration Platform",
      "shortDescription": "All-in-one Web3-enabled collaboration platform for freelancing, events, and real-time community chat.",
      "fullDescription": "W3nity is a unified Web3-enabled collaboration platform combining a freelancing marketplace with on-chain escrow, event management with NFT ticketing, and real-time community chat. The project includes frontend (React + TypeScript + Tailwind), a Node/Express backend, smart contracts (Solidity + Hardhat), and real-time features using Socket.IO.",
      "techStack": ["React", "TypeScript", "Tailwind CSS", "Framer Motion", "Node.js", "Express", "MongoDB", "Socket.IO", "Solidity", "Hardhat", "Ethers.js", "Wagmi", "Alchemy"],
      "implementation": [
        "Frontend SPA built with React + TypeScript and Tailwind CSS with component-based architecture",
        "Backend REST API using Node.js and Express with MongoDB (Mongoose)",
        "Real-time chat built on Socket.IO (WebSockets)",
        "Smart contracts (Escrow, ERC-721 ticketing) developed in Solidity and tested with Hardhat",
        "MetaMask + wallet integration (Wagmi/Ethers) and deployment-ready frontend (Vercel)"
      ],
      "liveLink": "https://w3nity.vercel.app",
      "githubLink": "https://github.com/nishantharkut/W3nity",
      "image": "/images/project1.jpg",
      "featured": true
    },
    {
      "id": 2,
      "title": "Hogwarts OS",
      "category": "Themed OS / Linux Distribution",
      "shortDescription": "A Harry-Potter–themed Linux Mint based OS and modular toolset — immersive UI, gamification, and AI-powered assistant.",
      "fullDescription": "Hogwarts OS reimagines the desktop experience with house-based personalization, spell-based terminal commands, an Electron-based Marauder’s Map file explorer, AI-powered portrait assistant, and gamification layers (XP, house points). It ships both as a full ISO distribution and modular installable components for Linux Mint.",
      "techStack": ["Linux Mint (Cinnamon)", "Electron", "Node.js", "Python", "Shell scripting", "GTK/GDM customizations"],
      "implementation": [
        "Full ISO build based on Linux Mint Cinnamon with branded boot and desktop customizations",
        "Modular apps (Sorting Hat, Marauder's Map, Owl Post) implemented as Electron/Python tools",
        "Spell-based terminal wrapper that maps friendly commands to shell commands",
        "AI-powered portrait assistant integrated via Agent AI / Akash Chat",
        "Gamification layer with XP, house points, and unlockables"
      ],
      "liveLink": "",
      "githubLink": "https://github.com/nishantharkut/Hogwarts-OS",
      "image": "/images/project2.jpg",
      "featured": true
    },
    {
      "id": 3,
      "title": "BookSwap",
      "category": "Mobile App (Android)",
      "shortDescription": "Campus-focused Android app for peer-to-peer book exchanges with listings, auctions, and real-time chat.",
      "fullDescription": "BookSwap is an Android application built to facilitate textbook and novel exchange within college campuses. It supports user authentication, book listings (including auctions and timers), image uploads via Cloudinary, and one-to-one real-time messaging between buyers and sellers using Firebase services.",
      "techStack": ["Java", "Android (XML layouts)", "MVVM", "Firebase Authentication", "Cloud Firestore", "Realtime Database", "Cloudinary", "LiveData", "Picasso"],
      "implementation": [
        "MVVM-structured Android app with Activities & Fragments for core screens",
        "Authentication and user management with Firebase Authentication",
        "Book listings stored in Firestore with images hosted on Cloudinary",
        "Real-time one-to-one chat implemented using Firebase Realtime Database",
        "Auction-style listings with timer UI and profile management"
      ],
      "liveLink": "",
      "githubLink": "https://github.com/nishantharkut/BookSwap",
      "image": "/images/bookswap.jpg",
      "featured": false
    },
    {
      "id": 4,
      "title": "GlobeTrotter",
      "category": "AI Powered Travel Planning Platform",
      "shortDescription": "Intelligent, collaborative travel planner with AI itinerary generation, budgeting tools, and visual trip sharing.",
      "fullDescription": "GlobeTrotter is a platform that simplifies multi-city trip planning through user-friendly features like AI-powered itinerary suggestions, cost estimation, visualization dashboards, and collaborative sharing. Built with a React frontend and Node/Express backend, it includes secure authentication, budget tracking, admin tools, and Cloudinary media storage.",
      "techStack": ["React.js", "Vite", "Tailwind CSS", "Material UI", "Node.js", "Express.js", "MongoDB (Mongoose)", "JWT", "Google OAuth 2.0", "Bcrypt", "Cloudinary", "Vercel", "Render", "Recharts"],
      "implementation": [
        "React frontend with Vite, styled using Tailwind CSS and Material UI components",
        "Node.js and Express.js backend providing REST APIs for authentication, trip CRUD, and AI integration",
        "MongoDB with Mongoose for storing users, trips, activities, budgets",
        "Authentication handled via JWT and Google OAuth, with secure password hashing via Bcrypt",
        "File uploads managed through Cloudinary, email notifications via Gmail SMTP",
        "Deployment: frontend on Vercel, backend on Render",
        "Admin dashboard implemented for user and content management with analytics",
        "AI-powered itinerary suggestions, budgeting cost breakdowns, timeline and calendar visualizations"
      ],
      "liveLink": "https://globe-trotter-code-fusion-ruddy.vercel.app",
      "githubLink": "https://github.com/nishantharkut/GlobeTrotter-CodeFusion",
      "image": "/images/project5.jpg",
      "featured": true
    },
    {
      "id": 5,
      "title": "NoobsterDSA",
      "category": "Web App / Productivity",
      "shortDescription": "A productivity web app to log, track, and analyze DSA and competitive programming practice.",
      "fullDescription": "NoobsterDSA centralizes DSA & CP practice tracking: daily logs, contest tracking, weekly goals, analytics dashboards, and auto-tagging of problems (platform/difficulty). Built for learners with a clean, gamified UI and PWA support.",
      "techStack": ["React (TypeScript)", "Vite", "Tailwind CSS", "shadcn/ui", "Radix UI", "Supabase", "PostgreSQL"],
      "implementation": [
        "Logging system for daily practice with metadata (date, topic, problems, time, notes)",
        "Contest performance tracker and weekly goals with reflections",
        "Analytics dashboards: heatmaps, time-distribution charts, and progress summaries",
        "Auto-tagging from problem URLs and markdown-enabled notes",
        "PWA features and responsive design for mobile/desktop"
      ],
      "liveLink": "https://noobster-dsa.vercel.app",
      "githubLink": "https://github.com/nishantharkut/Noobster-DSA",
      "image": "/images/project6.jpg"
    }
  ]
}
